#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//整形家族
//浮点型家族
//构造类型-自定义类型
//  数组
//	struct 结构体类型
//  enum 枚举
//  union 联合体
// 
//指针类型
// 
//空类型
//void 
//函数返回类型 void test();
//函数参数 void test(void);
//指针 void* p;


//int main()
//{
//	int a = -10;
//	int b = 10;
	//00000000000000000000000000001010
	//0000000a
	//
	//10000000000000000000000000001010-原码
	//11111111111111111111111111110101-反码
	//11111111111111111111111111110110-补码
	//FFFFFFF6
//	return 0;
//}

//大端字节序和小端字节序
//大端字节序：把数据的低位字节序的内容存放到高地址处，高位字节序的内容存放到低地址处。
//小端字节序：把数据的低位字节序的内容存放到低地址处，高位字节序的内容存放到高地址处。
//vs采用的是小端字节序

//int main()
//{
//	int a = 0x11223344;
//	//44-低位  11-高位
//	return 0;
//}

//判断当前机器的字节序

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;
//}
//int main()
//{
//	int ret = check_sys();
//	int a = 1;
//	if (ret == 1)
//	{
//		printf("小端");
//	}
//	else
//	{
//		printf("大端");
//	}
//	char* p = (char*)&a;//int*
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}



//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
	//整型提升 有符号高位补1 无符号高位补0
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//1.char类型到底是signed char还是unsigned char
//C语言标准没有规定，取决于编译器
// 
//int是signed 有符号的
//short是signed 

//int main()
//{
//	char a = -128;
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000-补码
	//10000000 -> -128
	//11111111111111111111111110000000
	// %u 以无符号的整型打印
//	printf("%u\n",a);
//	return 0;
//}

//int main()
//{
//	char a = 128;
	//00000000000000000000000010000000
	//100000000
	//111111111111111111111111100000000
//	printf("%u\n", a);
//	return 0;
//}

//char变量取值范围
//有符号的char的取值范围是：-128-127
//无符号的char的取值范围是：0-255

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
	//1000000000000000000000000010100
	//1111111111111111111111111101011
	//1111111111111111111111111101100
	//0000000000000000000000000001010
	//1111111111111111111111111110110--补码
	//1111111111111111111111111110101
	//1000000000000000000000000001010 --> -10
//	printf("%d\n", i + j);
//	return 0;
//}

//int main()
//{
//	unsigned int i = 0;//无符号整型
//	for (i = 9; i >= 0; i--)//判断条件恒成立 i最小也是等于0
//	{
//		printf("%u\n", i);
//	}
// 死循环
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
	//128 + 127 = 255
	//-1 -2 -3 -4 .... -127 -128 127 126 ...  3 2 1 0 -1 -2 -3 ..... -127 -128
	//'\0' --> 0
//	printf("%d", strlen(a));
//	return 0;
//} 

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}


//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//
//	*pFloat = 9.0;
//  1001.0
//  1.001*2^3
//  0 3+127 001
//  01000001000100000000000000000000
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	return 0;
//}

int main()
{
	float f = 5.5f;
	//double f = 5.5;
	//101.1 1.011 * 2^2  s=0 M=1.011 E=2
	//s=0 M=011 E=2+127
	//0100 0000 1011 0000 0000 0000 0000 0000
	//0x40 b0 00 00
	//double
	//0100 0000 0001 0110 0000 0000 0000 0000
	//0x40 16 00 00 00 00 00 00
 	return 0;
}